// Написать программу замену элементов массива на противоположные

int[] arr = {1, 2, 0, -4, 5};

for ( int i = 0; i < 5; i++) 
{
    Console.Write($"{arr[i]*-1} ");
}


